elisp/init-edit.org
PROPERTY: header-args:emacs-lisp :tangle init-edit.el :lexical t
#+TITLE: init-edit.el

* init-edit.el 文件头
#+begin_src emacs-lisp :tangle yes
  ;;; init-edit.el --- Editing settings -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:
#+end_src

* delsel
#+begin_src emacs-lisp :tangle yes
  ;; Delete selection if you insert
  (use-package delsel
    :ensure nil
    :hook (after-init . delete-selection-mode))
#+end_src

* rect
#+begin_src emacs-lisp :tangle yes
  (use-package rect
    :ensure nil
    :bind (:map text-mode-map
           ("<C-return>" . rect-hydra/body)
           :map prog-mode-map
           ("<C-return>" . rect-hydra/body))
    :init
    (with-eval-after-load 'org
      (bind-key "<s-return>" #'rect-hydra/body))
    (with-eval-after-load 'wgrep
      (bind-key "<C-return>" #'rect-hydra/body))
    (with-eval-after-load 'wdired
      (bind-key "<C-return>" #'rect-hydra/body)))
#+end_src

* autorevert
#+begin_src emacs-lisp :tangle yes
  (use-package autorevert
    :ensure nil
    :diminish
    :hook (after-init . global-auto-revert-mode))
#+end_src

* avy
#+begin_src emacs-lisp :tangle yes
  (use-package avy
    :bind (("C-:" . avy-goto-char)
           ("C-'" . avy-goto-char-2)
           ("M-g l" . avy-goto-line)
           ("M-g w" . avy-goto-word-1)
           ("M-g e" . avy-goto-word-0))
    :hook (after-init . avy-setup-default)
    :config (setq avy-all-windows nil
                  avy-all-windows-alt t
                  avy-background t
                  avy-style 'pre))

  (use-package avy-zap
    :bind (("M-z" . avy-zap-to-char-dwim)
           ("M-Z" . avy-zap-up-to-char-dwim)))
#+end_src

* ace-pinyin
#+begin_src emacs-lisp :tangle yes
  (use-package ace-pinyin
    :diminish
    :hook (after-init . ace-pinyin-global-mode))
#+end_src

* aggressive-indent
#+begin_src emacs-lisp :tangle yes
  (defun too-long-file-p ()
    "Check whether the file is too long."
    (or (> (buffer-size) 100000)
        (and (fboundp 'buffer-line-statistics)
             (> (car (buffer-line-statistics)) 10000))))

  (use-package aggressive-indent
    :diminish
    :hook ((after-init . global-aggressive-indent-mode)
           ;; NOTE: Disable in large files due to the performance issues.
           (find-file . (lambda ()
                          (when (too-long-file-p)
                            (aggressive-indent-mode -1)))))
    :config
    ;; Disable in some modes
    (dolist (mode '(gitconfig-mode
                    asm-mode web-mode html-mode css-mode
                    go-mode scala-mode shell-mode term-mode vterm-mode
                    prolog-inferior-mode solidity-mode))
      (add-to-list 'aggressive-indent-excluded-modes mode))

    ;; Disable in some commands
    (add-to-list 'aggressive-indent-protected-commands #'delete-trailing-whitespace t)

    ;; Be slightly less aggressive in C/C++/C#/Java/Go/Swift/Solidity
    (add-to-list 'aggressive-indent-dont-indent-if
                 '(and (derived-mode-p 'c-mode 'c++-mode 'csharp-mode
                                       'java-mode 'go-mode 'swift-mode 'solidity-mode)
                       (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                                           (thing-at-point 'line))))))
#+end_src

* anzu
#+begin_src emacs-lisp :tangle yes
  ;; Show number of matches in mode-line while searching
  (use-package anzu
    :diminish
    :bind (([remap query-replace] . anzu-query-replace)
           ([remap query-replace-regexp] . anzu-query-replace-regexp)
           :map isearch-mode-map
           ([remap isearch-query-replace] . anzu-isearch-query-replace)
           ([remap isearch-query-replace-regexp] . anzu-isearch-query-replace-regexp))
    :hook (after-init . global-anzu-mode))
#+end_src

* beginend
#+begin_src emacs-lisp :tangle yes
  ;; Redefine M-< and M-> for some modes
  (use-package beginend
    :diminish beginend-global-mode
    :hook (after-init . beginend-global-mode)
    :config (mapc (lambda (pair)
                    (diminish (cdr pair)))
                  beginend-modes))
#+end_src

* drag-suff
#+begin_src emacs-lisp :tangle yes
  ;; Drag stuff (lines, words, region, etc...) around
  (use-package drag-stuff
    :diminish
    :autoload drag-stuff-define-keys
    :hook (after-init . drag-stuff-mode)
    :config
    (add-to-list 'drag-stuff-except-modes 'org-mode)
    (drag-stuff-define-keys))
#+end_src

* ediff
#+begin_src emacs-lisp :tangle yes
  ;; A comprehensive visual interface to diff & patch
  (use-package ediff
    :ensure nil
    :hook (;; show org ediff unfold
           (ediff-prepare-buffer . outline-show-all)
           ;; restore window layout when done
           (ediff-quit . winner-undo))
    :config
    (setq ediff-window-setup-function 'ediff-setup-windows-plain
          ediff-split-window-function 'split-window-horizontally
          ediff-merge-split-window-function 'split-window-horizontally))
#+end_src

* elec-pair
#+begin_src emacs-lisp :tangle yes
  ;; Automatic parenthesis pairing
  (use-package elec-pair
    :ensure nil
    :hook (after-init . electric-pair-mode)
    :init (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))
#+end_src

* align
#+begin_src emacs-lisp :tangle yes
  ;; Visual `align-regexp'
  (use-package ialign)

  (use-package valign
    :commands valign-mode
    :init
    (add-hook 'org-mode-hook #'valign-mode)
    (add-hook 'markdown-mode-hook #'valign-mode))
#+end_src

* format
#+begin_src emacs-lisp :tangle yes
  (use-package format-all)

  (use-package pangu-spacing
    :init
    (global-pangu-spacing-mode 1)
    (setq pangu-spacing-real-insert-separtor t))
#+end_src

* multiple & region
#+begin_src emacs-lisp :tangle yes
  ;; Edit multiple regions in the same way simultaneously
  (use-package iedit
    :defines desktop-minor-mode-table
    :bind (("C-," . iedit-mode)
           ("C-x r RET" . iedit-rectangle-mode)
           :map isearch-mode-map ("C-;" . iedit-mode-from-isearch)
           :map esc-map ("C-;" . iedit-execute-last-modification)
           :map help-map ("C-;" . iedit-mode-toggle-on-function))
    :config
    ;; Avoid restoring `iedit-mode'
    (with-eval-after-load 'desktop
      (add-to-list 'desktop-minor-mode-table '(iedit-mode nil))))

  ;; Increase selected region by semantic units
  (use-package expand-region
    :bind ("C-=" . er/expand-region)
    :config
    (when (and (fboundp 'treesit-available-p)
               (treesit-available-p))
      (defun treesit-mark-bigger-node ()
        "Use tree-sitter to  mark regions."
        (let* ((root (treesit-buffer-root-node))
               (node (treesit-node-descendant-for-range root (region-beginning) (region-end)))
               (node-start (treesit-node-start node))
               (node-end (treesit-node-end node)))
          ;; Node fits the region exactly. Try its parent node instead
          (when (and (= (region-beginning) node-start) (= (region-end) node-end))
            (when-let ((node (treesit-node-parent node)))
              (setq node-start (treesit-node-start node)
                    node-end (treesit-node-end node))))
          (set-mark node-end)
          (goto-char node-start)))
      (add-to-list 'er/try-expand-list 'treesit-mark-bigger-node)))

  ;; Multiple cursors
  (use-package multiple-cursors
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C->" . mc/mark-next-like-this)
           ("C-<" . mc/mark-previous-like-this)
           ("C-c C-<" . mc/mark-all-like-this)
           ("C-M->" . mc/skip-to-next-like-this)
           ("C-M-<" . mc/skip-to-previous-like-this)
           ("s-<mouse-1>" . mc/add-cursor-on-click)
           ("C-S-<mouse-1>" . mc/add-cursor-on-click)
           :map mc/keymap
           ("C-|" . mc/vertical-align-with-space)))

  ;; Smartly select region, rectangle, multi cursors
  ;;(use-package smart-region
    ;;:hook (after-init . smart-region-on))
#+end_src

* flyspell
#+begin_src emacs-lisp :tangle yes
  ;; On-the-fly spell checker
  (use-package flyspell
    :ensure nil
    :diminish
    :if (executable-find "aspell")
    :hook ((((text-mode outline-mode) . flyspell-mode)
            (flyspell-mode . (lambda ()
                               (dolist (key '("C-;" "C-."))
                                 (unbind-key key flyspell-mode-map))))))
    :init (setq flyspell-issue-message-flag nil
                ispell-program-name "aspell"
                ispell-extra-args '("--sug-mode=ultra" "--lang=en_US" "--run-together")))
#+end_src

* hungry-delete
#+begin_src emacs-lisp :tangle yes
  ;; Hungry deletion
  (use-package hungry-delete
    :diminish
    :hook (after-init . global-hungry-delete-mode)
    :init (setq hungry-delete-chars-to-skip "\t\v"
                hungry-delete-except-modes
                '(help-mode minibuffer-mode minibuffer-inactive-mode calc-mode)))
#+end_src

* utils
#+begin_src emacs-lisp :tangle yes
  ;; Move to the beginning/end of line or code
  (use-package mwim
    :bind (([remap move-beginning-of-line] . mwim-beginning)
           ([remap move-end-of-line] . mwim-end)))

  ;; Treat undo history as a tree
  (if (>= emacs-major-version 28)
      (use-package vundo
        :bind ("C-x u" . vundo)
        :config (setq vundo-glyph-alist vundo-unicode-symbols))
    (use-package undo-tree
      :diminish
      :hook (after-init . global-undo-tree-mode)
      :init (setq undo-tree-visualizer-timestamp t
                  undo-tree-visualizer-diff t
                  undo-tree-enable-undo-in-region nil
                  undo-tree-auto-save-history nil)))

  ;; Goto last change
  (use-package goto-chg
    :bind ("C-," . goto-last-change))

  ;; Handling capitalized subwords in a nomenclature
  (use-package subword
    :ensure nil
    :diminish
    :hook ((prog-mode . subword-mode)
           (minibuffer-setup . subword-mode)))

  ;; Narrow/Widen
  (use-package fancy-narrow
    :diminish
    :hook (after-init . fancy-narrow-mode))

  ;; Handle minified code
  (use-package so-long
    :hook (after-init . global-so-long-mode))
#+end_src

* init-edit.el 文件尾
#+begin_src emacs-lisp :tangle yes
  (provide 'init-edit)

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; init-edit.el ends here
#+end_src
